In [127]:
import numpy as np
import pandas as pd

In [128]:
train = pd.read_csv("train.csv")

In [129]:
train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [130]:
train = train.drop(axis=1, labels="PassengerId")

In [131]:
train

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [132]:
train = train.drop(axis=1, labels="Cabin")

In [133]:
train

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S
...,...,...,...,...,...,...,...,...,...,...
886,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,S
887,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,S
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,S
889,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C
890,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,Q

In [134]:
gender_dct = {"male": 0, "female": 1}
train["Sex"] = [gender_dct[g] for g in train["Sex"]]
train

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C
2,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,S
4,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,S
...,...,...,...,...,...,...,...,...,...,...
886,0,2,"Montvila, Rev. Juozas",0,27.0,0,0,211536,13.0000,S
887,1,1,"Graham, Miss. Margaret Edith",1,19.0,0,0,112053,30.0000,S
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",1,NaN,1,2,W./C. 6607,23.4500,S
889,1,1,"Behr, Mr. Karl Howell",0,26.0,0,0,111369,30.0000,C
890,0,3,"Dooley, Mr. Patrick",0,32.0,0,0,370376,7.7500,Q

In [135]:
train = train.drop(axis=1, labels="Name")

In [136]:
train

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,0,3,0,22.0,1,0,A/5 21171,7.2500,S
1,1,1,1,38.0,1,0,PC 17599,71.2833,C
2,1,3,1,26.0,0,0,STON/O2. 3101282,7.9250,S
3,1,1,1,35.0,1,0,113803,53.1000,S
4,0,3,0,35.0,0,0,373450,8.0500,S
...,...,...,...,...,...,...,...,...,...
886,0,2,0,27.0,0,0,211536,13.0000,S
887,1,1,1,19.0,0,0,112053,30.0000,S
888,0,3,1,NaN,1,2,W./C. 6607,23.4500,S
889,1,1,0,26.0,0,0,111369,30.0000,C
890,0,3,0,32.0,0,0,370376,7.7500,Q

In [137]:
train.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Embarked      2
dtype: int64

In [138]:
from sklearn.impute import SimpleImputer

In [139]:
imputer = SimpleImputer(strategy="mean")

In [140]:
train["Age"] = imputer.fit_transform(np.array(train["Age"]).reshape((-1, 1)))

train

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,0,3,0,22.000000,1,0,A/5 21171,7.2500,S
1,1,1,1,38.000000,1,0,PC 17599,71.2833,C
2,1,3,1,26.000000,0,0,STON/O2. 3101282,7.9250,S
3,1,1,1,35.000000,1,0,113803,53.1000,S
4,0,3,0,35.000000,0,0,373450,8.0500,S
...,...,...,...,...,...,...,...,...,...
886,0,2,0,27.000000,0,0,211536,13.0000,S
887,1,1,1,19.000000,0,0,112053,30.0000,S
888,0,3,1,29.699118,1,2,W./C. 6607,23.4500,S
889,1,1,0,26.000000,0,0,111369,30.0000,C
890,0,3,0,32.000000,0,0,370376,7.7500,Q

In [141]:
train["Age"] = train["Age"].astype(int)

In [142]:
train

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,0,3,0,22,1,0,A/5 21171,7.2500,S
1,1,1,1,38,1,0,PC 17599,71.2833,C
2,1,3,1,26,0,0,STON/O2. 3101282,7.9250,S
3,1,1,1,35,1,0,113803,53.1000,S
4,0,3,0,35,0,0,373450,8.0500,S
...,...,...,...,...,...,...,...,...,...
886,0,2,0,27,0,0,211536,13.0000,S
887,1,1,1,19,0,0,112053,30.0000,S
888,0,3,1,29,1,2,W./C. 6607,23.4500,S
889,1,1,0,26,0,0,111369,30.0000,C
890,0,3,0,32,0,0,370376,7.7500,Q

In [143]:
train = train.drop(axis=1, labels="Ticket")

In [144]:
train

     Survived  Pclass  Sex  Age  SibSp  Parch     Fare Embarked
0           0       3    0   22      1      0   7.2500        S
1           1       1    1   38      1      0  71.2833        C
2           1       3    1   26      0      0   7.9250        S
3           1       1    1   35      1      0  53.1000        S
4           0       3    0   35      0      0   8.0500        S
..        ...     ...  ...  ...    ...    ...      ...      ...
886         0       2    0   27      0      0  13.0000        S
887         1       1    1   19      0      0  30.0000        S
888         0       3    1   29      1      2  23.4500        S
889         1       1    0   26      0      0  30.0000        C
890         0       3    0   32      0      0   7.7500        Q

[891 rows x 8 columns]

In [145]:
# train=
train = pd.get_dummies(data=train, prefix="")

In [146]:
train

     Survived  Pclass  Sex  Age  SibSp  Parch     Fare  _C  _Q  _S
0           0       3    0   22      1      0   7.2500   0   0   1
1           1       1    1   38      1      0  71.2833   1   0   0
2           1       3    1   26      0      0   7.9250   0   0   1
3           1       1    1   35      1      0  53.1000   0   0   1
4           0       3    0   35      0      0   8.0500   0   0   1
..        ...     ...  ...  ...    ...    ...      ...  ..  ..  ..
886         0       2    0   27      0      0  13.0000   0   0   1
887         1       1    1   19      0      0  30.0000   0   0   1
888         0       3    1   29      1      2  23.4500   0   0   1
889         1       1    0   26      0      0  30.0000   1   0   0
890         0       3    0   32      0      0   7.7500   0   1   0

[891 rows x 10 columns]

In [147]:
from sklearn.linear_model import LogisticRegression

In [148]:
logisReg = LogisticRegression(max_iter=1000)
y = train["Survived"]
X = train.drop(labels="Survived", axis=1)

In [149]:
logisReg.fit(X, y)

LogisticRegression(max_iter=1000)

In [150]:
test = pd.read_csv("test.csv")

In [151]:
test

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [152]:
test = test.drop(axis=1, labels=["Name", "PassengerId", "Cabin", ])

In [153]:
test

     Pclass     Sex   Age  SibSp  Parch              Ticket      Fare Embarked
0         3    male  34.5      0      0              330911    7.8292        Q
1         3  female  47.0      1      0              363272    7.0000        S
2         2    male  62.0      0      0              240276    9.6875        Q
3         3    male  27.0      0      0              315154    8.6625        S
4         3  female  22.0      1      1             3101298   12.2875        S
..      ...     ...   ...    ...    ...                 ...       ...      ...
413       3    male   NaN      0      0           A.5. 3236    8.0500        S
414       1  female  39.0      0      0            PC 17758  108.9000        C
415       3    male  38.5      0      0  SOTON/O.Q. 3101262    7.2500        S
416       3    male   NaN      0      0              359309    8.0500        S
417       3    male   NaN      1      1                2668   22.3583        C

[418 rows x 8 columns]

In [154]:
test = test.drop(axis=1, labels="Ticket")

In [155]:
test

     Pclass     Sex   Age  SibSp  Parch      Fare Embarked
0         3    male  34.5      0      0    7.8292        Q
1         3  female  47.0      1      0    7.0000        S
2         2    male  62.0      0      0    9.6875        Q
3         3    male  27.0      0      0    8.6625        S
4         3  female  22.0      1      1   12.2875        S
..      ...     ...   ...    ...    ...       ...      ...
413       3    male   NaN      0      0    8.0500        S
414       1  female  39.0      0      0  108.9000        C
415       3    male  38.5      0      0    7.2500        S
416       3    male   NaN      0      0    8.0500        S
417       3    male   NaN      1      1   22.3583        C

[418 rows x 7 columns]

In [156]:
train

     Survived  Pclass  Sex  Age  SibSp  Parch     Fare  _C  _Q  _S
0           0       3    0   22      1      0   7.2500   0   0   1
1           1       1    1   38      1      0  71.2833   1   0   0
2           1       3    1   26      0      0   7.9250   0   0   1
3           1       1    1   35      1      0  53.1000   0   0   1
4           0       3    0   35      0      0   8.0500   0   0   1
..        ...     ...  ...  ...    ...    ...      ...  ..  ..  ..
886         0       2    0   27      0      0  13.0000   0   0   1
887         1       1    1   19      0      0  30.0000   0   0   1
888         0       3    1   29      1      2  23.4500   0   0   1
889         1       1    0   26      0      0  30.0000   1   0   0
890         0       3    0   32      0      0   7.7500   0   1   0

[891 rows x 10 columns]

In [157]:
test["Sex"] = [gender_dct[g] for g in test["Sex"]]

In [158]:
test

     Pclass  Sex   Age  SibSp  Parch      Fare Embarked
0         3    0  34.5      0      0    7.8292        Q
1         3    1  47.0      1      0    7.0000        S
2         2    0  62.0      0      0    9.6875        Q
3         3    0  27.0      0      0    8.6625        S
4         3    1  22.0      1      1   12.2875        S
..      ...  ...   ...    ...    ...       ...      ...
413       3    0   NaN      0      0    8.0500        S
414       1    1  39.0      0      0  108.9000        C
415       3    0  38.5      0      0    7.2500        S
416       3    0   NaN      0      0    8.0500        S
417       3    0   NaN      1      1   22.3583        C

[418 rows x 7 columns]

In [159]:
test["Age"] = imputer.fit_transform(np.array(test["Age"]).reshape((-1, 1)))
test["Age"] = test["Age"].astype(int)

In [160]:
test

     Pclass  Sex  Age  SibSp  Parch      Fare Embarked
0         3    0   34      0      0    7.8292        Q
1         3    1   47      1      0    7.0000        S
2         2    0   62      0      0    9.6875        Q
3         3    0   27      0      0    8.6625        S
4         3    1   22      1      1   12.2875        S
..      ...  ...  ...    ...    ...       ...      ...
413       3    0   30      0      0    8.0500        S
414       1    1   39      0      0  108.9000        C
415       3    0   38      0      0    7.2500        S
416       3    0   30      0      0    8.0500        S
417       3    0   30      1      1   22.3583        C

[418 rows x 7 columns]

In [161]:
test = pd.get_dummies(data=test, prefix="")

In [162]:
test

     Pclass  Sex  Age  SibSp  Parch      Fare  _C  _Q  _S
0         3    0   34      0      0    7.8292   0   1   0
1         3    1   47      1      0    7.0000   0   0   1
2         2    0   62      0      0    9.6875   0   1   0
3         3    0   27      0      0    8.6625   0   0   1
4         3    1   22      1      1   12.2875   0   0   1
..      ...  ...  ...    ...    ...       ...  ..  ..  ..
413       3    0   30      0      0    8.0500   0   0   1
414       1    1   39      0      0  108.9000   1   0   0
415       3    0   38      0      0    7.2500   0   0   1
416       3    0   30      0      0    8.0500   0   0   1
417       3    0   30      1      1   22.3583   1   0   0

[418 rows x 9 columns]

In [163]:
test.isnull().sum()

Pclass    0
Sex       0
Age       0
SibSp     0
Parch     0
Fare      1
_C        0
_Q        0
_S        0
dtype: int64

In [164]:
test[test["Fare"].isnull()]

     Pclass  Sex  Age  SibSp  Parch  Fare  _C  _Q  _S
152       3    0   60      0      0   NaN   0   0   1

In [175]:
test["Fare"].iloc[152] = test.Fare.mean()

C:\Users\Samed Arslan\AppData\Local\Temp\ipykernel_20856\1077938347.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  test["Fare"].iloc[152] = test.Fare.mean()

In [176]:
test.Fare.iloc[152]

35.62718841216038

In [177]:
prediction = logisReg.predict(test)

In [178]:
from sklearn.metrics import classification_report, accuracy_score

y_true = pd.read_csv("gender_submission.csv")
y_true = y_true.drop(axis=1, labels="PassengerId")

In [179]:
print(classification_report(y_true=y_true, y_pred=prediction))

              precision    recall  f1-score   support

           0       0.96      0.95      0.95       266
           1       0.92      0.93      0.92       152

    accuracy                           0.94       418
   macro avg       0.94      0.94      0.94       418
weighted avg       0.94      0.94      0.94       418

In [180]:
print(accuracy_score(y_true=y_true, y_pred=prediction))

0.9425837320574163